src/DataProcessors/InfobaseConnectionBlocking.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<DataProcessor>
		<Properties>
			<Name>InfobaseConnectionBlocking</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>KeyCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LockBegin</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LockEnding</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Message</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RejectNewConnections</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/InfobaseConnectionBlocking/Ext/ObjectModule.bsl
// Set or remove infobase lock,
// on the basis of data processor attribute values.
//
Procedure RunSetup() Export
	
	Block 			= New SessionsLock;
	Block.Begin     = LockBegin;
	Block.End       = LockEnding;
	Block.Message   = InfobaseConnections.GenerateBlockMessage(Message, KeyCode); 
	Block.Use       = RejectNewConnections;
	Block.KeyCode   = KeyCode;
	
	SetSessionsLock(Block);
	
EndProcedure

// Read infobase lock parameters
// to data processor attributes.
//
Procedure GetBlockParameters() Export
	
	CurrentMode = GetSessionsLock();
	
	RejectNewConnections = CurrentMode.Use;
	Message             = InfobaseConnectionsClientServer.ExtractLockMessage(CurrentMode.Message);
	KeyCode             = CurrentMode.KeyCode;
	
	If RejectNewConnections Then
		LockBegin       = CurrentMode.Begin;
		LockEnding      = CurrentMode.End;
	Else	
		// If lock is not set, then it's possible, that
		// user has opened form for lock setup.
		// Thus set lock date equal to current date
		LockBegin       = CurrentDate();
	EndIf;
	
EndProcedure
